import React from 'react';

// Під час кліку на елемент галереї повинно відкриватися модальне вікно з темним оверлеєм
// і відображатися велика версія зображення.Модальне вікно повинно закриватися по натисканню
// клавіші ESC або по кліку на оверлеї.

// Зовнішній вигляд схожий на функціонал цього VanillaJS-плагіна, тільки замість білого модального
//  вікна рендериться зображення(у прикладі натисніть Run).Анімацію робити не потрібно!

export const Modal = () => (
  <div class="overlay">
    <div class="modal">
      <img src="" alt="" />
    </div>
  </div>
);
